#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float       
; NORMAL                   0   xyz         1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float       
; SV_InstanceID            0   x           3   INSTID    uint       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float   xyzw
; NORMAL                   0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
; MATINDEX                 0   x           3     NONE    uint   x   
; SV_Position              0   xyzw        4      POS   float   xyzw
;
; shader debug name: c6bcc8b863121c559a674d466196c255.lld
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; NORMAL                   0                              
; TEXCOORD                 0                              
; SV_InstanceID            0                              
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !59, globals: !93)
!1 = !DIFile(filename: "src\5Cshaders\5Csrc\5Cshaders\5CHDR_I_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !21)
!6 = !{!7, !9, !17}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !5, file: !1, baseType: !8, size: 32, align: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !5, file: !1, type: !10, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !13)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !5, file: !1, type: !18, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!18 = !DISubroutineType(types: !19)
!19 = !{!12, !20, !16}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!21 = !{!22, !23}
!22 = !DITemplateTypeParameter(name: "element", type: !13)
!23 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 46, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 46, size: 288, align: 32, elements: !26, templateParams: !56)
!26 = !{!27, !32, !51}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !25, file: !1, line: 46, baseType: !28, size: 288, align: 32)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 288, align: 32, elements: !30)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, align: 32, flags: DIFlagVector, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 3)
!32 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$02$02@@QAAAAV?$vector@M$02@@I@Z", scope: !25, file: !1, line: 46, type: !33, isLocal: false, isDefinition: false, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !50, !16}
!35 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !37, templateParams: !48)
!37 = !{!38, !39, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !36, file: !1, baseType: !8, size: 32, align: 32)
!39 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !36, file: !1, type: !40, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!40 = !DISubroutineType(types: !41)
!41 = !{!12, !42, !16}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!44 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !36, file: !1, type: !45, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!12, !47, !16}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!48 = !{!22, !49}
!49 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!51 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$02$02@@QBAAAV?$vector@M$02@@I@Z", scope: !25, file: !1, line: 46, type: !52, isLocal: false, isDefinition: false, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!35, !54, !16}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!56 = !{!22, !57, !58}
!57 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 3)
!58 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 3)
!59 = !{!60}
!60 = !DISubprogram(name: "main", scope: !61, file: !61, line: 38, type: !62, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!61 = !DIFile(filename: "src\5Cshaders\5CHDR_I_VS.hlsl", directory: "")
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !88, !86}
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexShaderOutput", file: !61, line: 29, size: 448, align: 32, elements: !65)
!65 = !{!66, !67, !69, !85, !87}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !64, file: !61, line: 30, baseType: !4, size: 128, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "NormalVS", scope: !64, file: !61, line: 31, baseType: !68, size: 96, align: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !36)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !64, file: !61, line: 32, baseType: !70, size: 64, align: 32, offset: 224)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !72, templateParams: !83)
!72 = !{!73, !74, !79}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !71, file: !1, baseType: !8, size: 32, align: 32)
!74 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !71, file: !1, type: !75, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!12, !77, !16}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!79 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !71, file: !1, type: !80, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!80 = !DISubroutineType(types: !81)
!81 = !{!12, !82, !16}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!83 = !{!22, !84}
!84 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "MatIndex", scope: !64, file: !61, line: 33, baseType: !86, size: 32, align: 32, offset: 288)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !64, file: !61, line: 34, baseType: !4, size: 128, align: 32, offset: 320)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexPositionNormalTexture", file: !61, line: 23, size: 256, align: 32, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !88, file: !61, line: 24, baseType: !68, size: 96, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !88, file: !61, line: 25, baseType: !68, size: 96, align: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !88, file: !61, line: 26, baseType: !70, size: 64, align: 32, offset: 192)
!93 = !{!94}
!94 = !DIGlobalVariable(name: "gInstanceData", linkageName: "\01?gInstanceData@@3V?$StructuredBuffer@UInstanceData@@@@A", scope: !0, file: !61, line: 19, type: !95, isLocal: false, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<InstanceData>", file: !1, line: 19, size: 2176, align: 32, elements: !96, templateParams: !128)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !95, file: !1, line: 19, baseType: !98, size: 2176, align: 32)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "InstanceData", file: !61, line: 8, size: 2176, align: 32, elements: !99)
!99 = !{!100, !121, !122, !123, !124, !125, !126, !127}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ModelMatrix", scope: !98, file: !61, line: 9, baseType: !101, size: 512, align: 32)
!101 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 43, size: 512, align: 32, elements: !102, templateParams: !118)
!102 = !{!103, !108, !113}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !101, file: !1, line: 43, baseType: !104, size: 512, align: 32)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 512, align: 32, elements: !106)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, align: 32, flags: DIFlagVector, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 4)
!108 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$03$03@@QAAAAV?$vector@M$03@@I@Z", scope: !101, file: !1, line: 43, type: !109, isLocal: false, isDefinition: false, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !112, !16}
!111 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !5)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!113 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$matrix@M$03$03@@QBAAAV?$vector@M$03@@I@Z", scope: !101, file: !1, line: 43, type: !114, isLocal: false, isDefinition: false, scopeLine: 43, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!114 = !DISubroutineType(types: !115)
!115 = !{!111, !116, !16}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!118 = !{!22, !119, !120}
!119 = !DITemplateValueParameter(name: "row_count", type: !8, value: i32 4)
!120 = !DITemplateValueParameter(name: "col_count", type: !8, value: i32 4)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ModelViewMatrix", scope: !98, file: !61, line: 10, baseType: !101, size: 512, align: 32, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "InverseTransposeModelViewMatrix", scope: !98, file: !61, line: 11, baseType: !101, size: 512, align: 32, offset: 1024)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ModelViewProjectionMatrix", scope: !98, file: !61, line: 12, baseType: !101, size: 512, align: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "MaterialIndex", scope: !98, file: !61, line: 13, baseType: !86, size: 32, align: 32, offset: 2048)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "InstPad0", scope: !98, file: !61, line: 14, baseType: !86, size: 32, align: 32, offset: 2080)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "InstPad1", scope: !98, file: !61, line: 15, baseType: !86, size: 32, align: 32, offset: 2112)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "InstPad2", scope: !98, file: !61, line: 16, baseType: !86, size: 32, align: 32, offset: 2144)
!128 = !{!129}
!129 = !DITemplateTypeParameter(name: "element", type: !98)
!130 = !{i32 2, !"Dwarf Version", i32 4}
!131 = !{i32 2, !"Debug Info Version", i32 3}
!132 = !{!"dxc 1.2"}
!133 = !{!"src\5Cshaders\5CHDR_I_VS.hlsl", !"struct Mat {\0D\0A  matrix ModelMatrix;\0D\0A  matrix ModelViewMatrix;\0D\0A  matrix InverseTransposeModelViewMatrix;\0D\0A  matrix ModelViewProjectionMatrix;\0D\0A};\0D\0A\0D\0Astruct InstanceData {\0D\0A  matrix ModelMatrix;\0D\0A  matrix ModelViewMatrix;\0D\0A  matrix InverseTransposeModelViewMatrix;\0D\0A  matrix ModelViewProjectionMatrix;\0D\0A  uint MaterialIndex;\0D\0A  uint InstPad0;\0D\0A  uint InstPad1;\0D\0A  uint InstPad2;\0D\0A};\0D\0A\0D\0AStructuredBuffer<InstanceData> gInstanceData : register(t0, space1);\0D\0AConstantBuffer<Mat> MatCB : register(b0);\0D\0A\0D\0A\0D\0Astruct VertexPositionNormalTexture {\0D\0A  float3 Position : POSITION;\0D\0A  float3 Normal   : NORMAL;\0D\0A  float2 TexCoord : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VertexShaderOutput {\0D\0A  float4 PositionVS : POSITION;\0D\0A  float3 NormalVS   : NORMAL;\0D\0A  float2 TexCoord   : TEXCOORD;\0D\0A  nointerpolation uint MatIndex  : MATINDEX;\0D\0A  float4 Position   : SV_Position;\0D\0A\0D\0A};\0D\0A\0D\0AVertexShaderOutput main(VertexPositionNormalTexture IN, uint instanceID : SV_InstanceID) {\0D\0A  VertexShaderOutput OUT;\0D\0A\0D\0A  //OUT.Position = mul(MatCB.ModelViewProjectionMatrix, float4(IN.Position, 1.0f));\0D\0A  //matrix vp = mul(MatCB.)\0D\0A  InstanceData instData = gInstanceData[instanceID];\0D\0A  OUT.Position = mul(instData.ModelViewProjectionMatrix, float4(IN.Position, 1.0f));\0D\0A  OUT.PositionVS = mul(instData.ModelViewMatrix, float4(IN.Position, 1.0f));\0D\0A  OUT.NormalVS = mul((float3x3)instData.InverseTransposeModelViewMatrix, IN.Normal);\0D\0A  OUT.TexCoord = IN.TexCoord;\0D\0A\0D\0A  uint matIndex = instData.MaterialIndex;\0D\0A  OUT.MatIndex = matIndex;\0D\0A\0D\0A  return OUT;\0D\0A}"}
!134 = !{!"src\5Cshaders\5CHDR_I_VS.hlsl"}
!135 = !{!"/E", !"main", !"/T", !"vs_6_0", !"/Od", !"/Zi"}
!136 = !{i32 1, i32 0}
!137 = !{i32 1, i32 4}
!138 = !{!"vs", i32 6, i32 0}
!139 = !{!140, null, null, null}
!140 = !{!141}
!141 = !{i32 0, %"dx.alignment.legacy.class.StructuredBuffer<InstanceData>"* undef, !"gInstanceData", i32 1, i32 0, i32 1, i32 12, i32 0, !142}
!142 = !{i32 1, i32 272}
!143 = !{i32 0, %"class.StructuredBuffer<InstanceData>" undef, !144, %struct.InstanceData undef, !146, %struct.Mat undef, !156, %struct.VertexShaderOutput undef, !157, %struct.VertexPositionNormalTexture undef, !163, %dx.alignment.legacy.struct.InstanceData undef, !146, %"dx.alignment.legacy.class.StructuredBuffer<InstanceData>" undef, !144}
!144 = !{i32 272, !145}
!145 = !{i32 6, !"h", i32 3, i32 0}
!146 = !{i32 272, !147, !149, !150, !151, !152, !153, !154, !155}
!147 = !{i32 6, !"ModelMatrix", i32 2, !148, i32 3, i32 0, i32 7, i32 9}
!148 = !{i32 4, i32 4, i32 2}
!149 = !{i32 6, !"ModelViewMatrix", i32 2, !148, i32 3, i32 64, i32 7, i32 9}
!150 = !{i32 6, !"InverseTransposeModelViewMatrix", i32 2, !148, i32 3, i32 128, i32 7, i32 9}
!151 = !{i32 6, !"ModelViewProjectionMatrix", i32 2, !148, i32 3, i32 192, i32 7, i32 9}
!152 = !{i32 6, !"MaterialIndex", i32 3, i32 256, i32 7, i32 5}
!153 = !{i32 6, !"InstPad0", i32 3, i32 260, i32 7, i32 5}
!154 = !{i32 6, !"InstPad1", i32 3, i32 264, i32 7, i32 5}
!155 = !{i32 6, !"InstPad2", i32 3, i32 268, i32 7, i32 5}
!156 = !{i32 256, !147, !149, !150, !151}
!157 = !{i32 64, !158, !159, !160, !161, !162}
!158 = !{i32 6, !"PositionVS", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!159 = !{i32 6, !"NormalVS", i32 3, i32 16, i32 4, !"NORMAL", i32 7, i32 9}
!160 = !{i32 6, !"TexCoord", i32 3, i32 32, i32 4, !"TEXCOORD", i32 7, i32 9}
!161 = !{i32 6, !"MatIndex", i32 3, i32 40, i32 4, !"MATINDEX", i32 5, i32 1, i32 7, i32 5}
