#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float       
; NORMAL                   0   xyz         1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: ab3ccf3b41ba361364187d1c7c0f95ae.lld
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                 linear       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer MaterialCB
; {
;
;   struct MaterialCB
;   {
;
;       struct struct.Material
;       {
;
;           float4 Emissive;                          ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !107)
!1 = !DIFile(filename: "src\5Cshaders\5Csrc\5Cshaders\5CHDR_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !63, !70, !81, !84, !87, !90, !104}
!4 = !DISubprogram(name: "main", scope: !5, file: !5, line: 175, type: !6, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DIFile(filename: "src\5Cshaders\5CHDR_PS.hlsl", directory: "")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !28}
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !9)
!9 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !10, templateParams: !25)
!10 = !{!11, !13, !21}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !9, file: !1, baseType: !12, size: 32, align: 32)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !9, file: !1, type: !14, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !18, !20}
!16 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !17)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !9, file: !1, type: !22, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!22 = !DISubroutineType(types: !23)
!23 = !{!16, !24, !20}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!25 = !{!26, !27}
!26 = !DITemplateTypeParameter(name: "element", type: !17)
!27 = !DITemplateValueParameter(name: "element_count", type: !12, value: i32 4)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "PixelShaderInput", file: !5, line: 1, size: 288, align: 32, elements: !29)
!29 = !{!30, !31, !47}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !28, file: !5, line: 3, baseType: !8, size: 128, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "NormalVS", scope: !28, file: !5, line: 4, baseType: !32, size: 96, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !34, templateParams: !45)
!34 = !{!35, !36, !41}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !33, file: !1, baseType: !12, size: 32, align: 32)
!36 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !33, file: !1, type: !37, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!37 = !DISubroutineType(types: !38)
!38 = !{!16, !39, !20}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!41 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !33, file: !1, type: !42, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{!16, !44, !20}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!45 = !{!26, !46}
!46 = !DITemplateValueParameter(name: "element_count", type: !12, value: i32 3)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !28, file: !5, line: 5, baseType: !48, size: 64, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !50, templateParams: !61)
!50 = !{!51, !52, !57}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !49, file: !1, baseType: !12, size: 32, align: 32)
!52 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !49, file: !1, type: !53, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!16, !55, !20}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!57 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !49, file: !1, type: !58, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!16, !60, !20}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!61 = !{!26, !62}
!62 = !DITemplateValueParameter(name: "element_count", type: !12, value: i32 2)
!63 = !DISubprogram(name: "DoLighting", linkageName: "\01?DoLighting@@YA?AULightResult@@V?$vector@M$02@@0@Z", scope: !5, file: !5, line: 147, type: !64, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !32, !32}
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightResult", file: !5, line: 65, size: 256, align: 32, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !66, file: !5, line: 67, baseType: !8, size: 128, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !66, file: !5, line: 68, baseType: !8, size: 128, align: 32, offset: 128)
!70 = !DISubprogram(name: "DoPointLight", linkageName: "\01?DoPointLight@@YA?AULightResult@@UPointLight@@V?$vector@M$02@@11@Z", scope: !5, file: !5, line: 115, type: !71, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!66, !73, !32, !32, !32}
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "PointLight", file: !5, line: 24, size: 512, align: 32, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !73, file: !5, line: 26, baseType: !8, size: 128, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !73, file: !5, line: 28, baseType: !8, size: 128, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !73, file: !5, line: 30, baseType: !8, size: 128, align: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !73, file: !5, line: 32, baseType: !17, size: 32, align: 32, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Attenuation", scope: !73, file: !5, line: 33, baseType: !17, size: 32, align: 32, offset: 416)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !73, file: !5, line: 34, baseType: !48, size: 64, align: 32, offset: 448)
!81 = !DISubprogram(name: "DoAttenuation", linkageName: "\01?DoAttenuation@@YAMMM@Z", scope: !5, file: !5, line: 102, type: !82, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!17, !17, !17}
!84 = !DISubprogram(name: "DoDiffuse", linkageName: "\01?DoDiffuse@@YAMV?$vector@M$02@@0@Z", scope: !5, file: !5, line: 89, type: !85, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!17, !32, !32}
!87 = !DISubprogram(name: "DoSpecular", linkageName: "\01?DoSpecular@@YAMV?$vector@M$02@@00@Z", scope: !5, file: !5, line: 94, type: !88, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{!17, !32, !32, !32}
!90 = !DISubprogram(name: "DoSpotLight", linkageName: "\01?DoSpotLight@@YA?AULightResult@@USpotLight@@V?$vector@M$02@@11@Z", scope: !5, file: !5, line: 130, type: !91, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{!66, !93, !32, !32, !32}
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpotLight", file: !5, line: 39, size: 768, align: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !93, file: !5, line: 41, baseType: !8, size: 128, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !93, file: !5, line: 43, baseType: !8, size: 128, align: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "DirectionWS", scope: !93, file: !5, line: 45, baseType: !8, size: 128, align: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "DirectionVS", scope: !93, file: !5, line: 47, baseType: !8, size: 128, align: 32, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !93, file: !5, line: 49, baseType: !8, size: 128, align: 32, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !93, file: !5, line: 51, baseType: !17, size: 32, align: 32, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "SpotAngle", scope: !93, file: !5, line: 52, baseType: !17, size: 32, align: 32, offset: 672)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Attenuation", scope: !93, file: !5, line: 53, baseType: !17, size: 32, align: 32, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !93, file: !5, line: 54, baseType: !17, size: 32, align: 32, offset: 736)
!104 = !DISubprogram(name: "DoSpotCone", linkageName: "\01?DoSpotCone@@YAMV?$vector@M$02@@0M@Z", scope: !5, file: !5, line: 107, type: !105, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false)
!105 = !DISubroutineType(types: !106)
!106 = !{!17, !32, !32, !17}
!107 = !{!108, !114, !120, !137}
!108 = !DIGlobalVariable(name: "PointLights", linkageName: "\01?PointLights@@3V?$StructuredBuffer@UPointLight@@@@A", scope: !0, file: !5, line: 74, type: !109, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<PointLight>"* @"\01?PointLights@@3V?$StructuredBuffer@UPointLight@@@@A")
!109 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<PointLight>", file: !1, line: 74, size: 512, align: 32, elements: !110, templateParams: !112)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !109, file: !1, line: 74, baseType: !73, size: 512, align: 32)
!112 = !{!113}
!113 = !DITemplateTypeParameter(name: "element", type: !73)
!114 = !DIGlobalVariable(name: "SpotLights", linkageName: "\01?SpotLights@@3V?$StructuredBuffer@USpotLight@@@@A", scope: !0, file: !5, line: 75, type: !115, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<SpotLight>"* @"\01?SpotLights@@3V?$StructuredBuffer@USpotLight@@@@A")
!115 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<SpotLight>", file: !1, line: 75, size: 768, align: 32, elements: !116, templateParams: !118)
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !115, file: !1, line: 75, baseType: !93, size: 768, align: 32)
!118 = !{!119}
!119 = !DITemplateTypeParameter(name: "element", type: !93)
!120 = !DIGlobalVariable(name: "DiffuseTexture", linkageName: "\01?DiffuseTexture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !5, line: 76, type: !121, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?DiffuseTexture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!121 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 76, size: 160, align: 32, elements: !122, templateParams: !135)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !121, file: !1, line: 76, baseType: !9, size: 128, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mips", scope: !121, file: !1, line: 76, baseType: !125, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!125 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_type", scope: !121, file: !1, line: 76, size: 32, align: 32, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !125, file: !1, line: 76, baseType: !20, size: 32, align: 32)
!128 = !DISubprogram(name: "operator[]", linkageName: "\01??Amips_type@?$Texture2D@V?$vector@M$03@@@@QBA$$QAVmips_slice_type@1@I@Z", scope: !125, file: !1, line: 76, type: !129, isLocal: false, isDefinition: false, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !133, !20}
!131 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_slice_type", scope: !121, file: !1, line: 76, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!135 = !{!136}
!136 = !DITemplateTypeParameter(name: "element", type: !9)
!137 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !5, line: 78, type: !138, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearRepeatSampler@@3USamplerState@@A")
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 78, size: 32, align: 32, elements: !139)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !138, file: !1, line: 78, baseType: !12, size: 32, align: 32, flags: DIFlagPrivate)
!141 = !{i32 2, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{!"dxc 1.2"}
