#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float       
; NORMAL                   0   xyz         1     NONE   float       
; TEXCOORD                 0   xy          2     NONE   float       
; MATINDEX                 0   x           3     NONE    uint       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 9527ffd4a44c01515d853c8f84db9a56.lld
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                 linear       
; NORMAL                   0                 linear       
; TEXCOORD                 0                 linear       
; MATINDEX                 0        nointerpolation       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer LightPropertiesCB
; {
;
;   struct LightPropertiesCB
;   {

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !109)
!1 = !DIFile(filename: "src\5Cshaders\5Csrc\5Cshaders\5CHDR_I_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !65, !72, !83, !86, !89, !92, !106}
!4 = !DISubprogram(name: "main", scope: !5, file: !5, line: 179, type: !6, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DIFile(filename: "src\5Cshaders\5CHDR_I_PS.hlsl", directory: "")
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !28}
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !9)
!9 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !10, templateParams: !25)
!10 = !{!11, !13, !21}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !9, file: !1, baseType: !12, size: 32, align: 32)
!12 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!13 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QBAAAMI@Z", scope: !9, file: !1, type: !14, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !18, !20}
!16 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !17)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$03@@QAAAAMI@Z", scope: !9, file: !1, type: !22, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!22 = !DISubroutineType(types: !23)
!23 = !{!16, !24, !20}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!25 = !{!26, !27}
!26 = !DITemplateTypeParameter(name: "element", type: !17)
!27 = !DITemplateValueParameter(name: "element_count", type: !12, value: i32 4)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "PixelShaderInput", file: !5, line: 1, size: 320, align: 32, elements: !29)
!29 = !{!30, !31, !47, !63}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !28, file: !5, line: 2, baseType: !8, size: 128, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "NormalVS", scope: !28, file: !5, line: 3, baseType: !32, size: 96, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !34, templateParams: !45)
!34 = !{!35, !36, !41}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !33, file: !1, baseType: !12, size: 32, align: 32)
!36 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QBAAAMI@Z", scope: !33, file: !1, type: !37, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!37 = !DISubroutineType(types: !38)
!38 = !{!16, !39, !20}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!41 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$02@@QAAAAMI@Z", scope: !33, file: !1, type: !42, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!42 = !DISubroutineType(types: !43)
!43 = !{!16, !44, !20}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!45 = !{!26, !46}
!46 = !DITemplateValueParameter(name: "element_count", type: !12, value: i32 3)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !28, file: !5, line: 4, baseType: !48, size: 64, align: 32, offset: 224)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !50, templateParams: !61)
!50 = !{!51, !52, !57}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !49, file: !1, baseType: !12, size: 32, align: 32)
!52 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QBAAAMI@Z", scope: !49, file: !1, type: !53, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!16, !55, !20}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!57 = !DISubprogram(name: "operator[]", linkageName: "\01??A?$vector@M$01@@QAAAAMI@Z", scope: !49, file: !1, type: !58, isLocal: false, isDefinition: false, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!16, !60, !20}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!61 = !{!26, !62}
!62 = !DITemplateValueParameter(name: "element_count", type: !12, value: i32 2)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "MatIndex", scope: !28, file: !5, line: 5, baseType: !64, size: 32, align: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !20)
!65 = !DISubprogram(name: "DoLighting", linkageName: "\01?DoLighting@@YA?AULightResult@@V?$vector@M$02@@0M@Z", scope: !5, file: !5, line: 154, type: !66, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !32, !32, !17}
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightResult", file: !5, line: 78, size: 256, align: 32, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !68, file: !5, line: 79, baseType: !8, size: 128, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !68, file: !5, line: 80, baseType: !8, size: 128, align: 32, offset: 128)
!72 = !DISubprogram(name: "DoPointLight", linkageName: "\01?DoPointLight@@YA?AULightResult@@UPointLight@@V?$vector@M$02@@11M@Z", scope: !5, file: !5, line: 124, type: !73, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{!68, !75, !32, !32, !32, !17}
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "PointLight", file: !5, line: 40, size: 512, align: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !75, file: !5, line: 41, baseType: !8, size: 128, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !75, file: !5, line: 43, baseType: !8, size: 128, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !75, file: !5, line: 45, baseType: !8, size: 128, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !75, file: !5, line: 47, baseType: !17, size: 32, align: 32, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Attenuation", scope: !75, file: !5, line: 48, baseType: !17, size: 32, align: 32, offset: 416)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !75, file: !5, line: 49, baseType: !48, size: 64, align: 32, offset: 448)
!83 = !DISubprogram(name: "DoAttenuation", linkageName: "\01?DoAttenuation@@YAMMM@Z", scope: !5, file: !5, line: 113, type: !84, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false)
!84 = !DISubroutineType(types: !85)
!85 = !{!17, !17, !17}
!86 = !DISubprogram(name: "DoDiffuse", linkageName: "\01?DoDiffuse@@YAMV?$vector@M$02@@0@Z", scope: !5, file: !5, line: 102, type: !87, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{!17, !32, !32}
!89 = !DISubprogram(name: "DoSpecular", linkageName: "\01?DoSpecular@@YAMV?$vector@M$02@@00M@Z", scope: !5, file: !5, line: 106, type: !90, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubroutineType(types: !91)
!91 = !{!17, !32, !32, !32, !17}
!92 = !DISubprogram(name: "DoSpotLight", linkageName: "\01?DoSpotLight@@YA?AULightResult@@USpotLight@@V?$vector@M$02@@11M@Z", scope: !5, file: !5, line: 138, type: !93, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!93 = !DISubroutineType(types: !94)
!94 = !{!68, !95, !32, !32, !32, !17}
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpotLight", file: !5, line: 54, size: 768, align: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "PositionWS", scope: !95, file: !5, line: 55, baseType: !8, size: 128, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "PositionVS", scope: !95, file: !5, line: 57, baseType: !8, size: 128, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "DirectionWS", scope: !95, file: !5, line: 59, baseType: !8, size: 128, align: 32, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "DirectionVS", scope: !95, file: !5, line: 61, baseType: !8, size: 128, align: 32, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !95, file: !5, line: 63, baseType: !8, size: 128, align: 32, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Intensity", scope: !95, file: !5, line: 65, baseType: !17, size: 32, align: 32, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "SpotAngle", scope: !95, file: !5, line: 66, baseType: !17, size: 32, align: 32, offset: 672)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Attenuation", scope: !95, file: !5, line: 67, baseType: !17, size: 32, align: 32, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !95, file: !5, line: 68, baseType: !17, size: 32, align: 32, offset: 736)
!106 = !DISubprogram(name: "DoSpotCone", linkageName: "\01?DoSpotCone@@YAMV?$vector@M$02@@0M@Z", scope: !5, file: !5, line: 117, type: !107, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubroutineType(types: !108)
!108 = !{!17, !32, !32, !17}
!109 = !{!110, !116, !122, !142, !146}
!110 = !DIGlobalVariable(name: "PointLights", linkageName: "\01?PointLights@@3V?$StructuredBuffer@UPointLight@@@@A", scope: !0, file: !5, line: 86, type: !111, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<PointLight>"* @"\01?PointLights@@3V?$StructuredBuffer@UPointLight@@@@A")
!111 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<PointLight>", file: !1, line: 86, size: 512, align: 32, elements: !112, templateParams: !114)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !111, file: !1, line: 86, baseType: !75, size: 512, align: 32)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "element", type: !75)
!116 = !DIGlobalVariable(name: "SpotLights", linkageName: "\01?SpotLights@@3V?$StructuredBuffer@USpotLight@@@@A", scope: !0, file: !5, line: 87, type: !117, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<SpotLight>"* @"\01?SpotLights@@3V?$StructuredBuffer@USpotLight@@@@A")
!117 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<SpotLight>", file: !1, line: 87, size: 768, align: 32, elements: !118, templateParams: !120)
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !117, file: !1, line: 87, baseType: !95, size: 768, align: 32)
!120 = !{!121}
!121 = !DITemplateTypeParameter(name: "element", type: !95)
!122 = !DIGlobalVariable(name: "DiffuseTexture", linkageName: "\01?DiffuseTexture@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !5, line: 88, type: !123, isLocal: false, isDefinition: true, variable: [2 x %"class.Texture2D<vector<float, 4> >"]* @"\01?DiffuseTexture@@3PAV?$Texture2D@V?$vector@M$03@@@@A")
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 320, align: 32, elements: !140)
!124 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !125, templateParams: !138)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !124, file: !1, line: 88, baseType: !9, size: 128, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mips", scope: !124, file: !1, line: 88, baseType: !128, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!128 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_type", scope: !124, file: !1, line: 88, size: 32, align: 32, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !128, file: !1, line: 88, baseType: !20, size: 32, align: 32)
!131 = !DISubprogram(name: "operator[]", linkageName: "\01??Amips_type@?$Texture2D@V?$vector@M$03@@@@QBA$$QAVmips_slice_type@1@I@Z", scope: !128, file: !1, line: 88, type: !132, isLocal: false, isDefinition: false, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: false)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !136, !20}
!134 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_class_type, name: "mips_slice_type", scope: !124, file: !1, line: 88, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32, align: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!138 = !{!139}
!139 = !DITemplateTypeParameter(name: "element", type: !9)
!140 = !{!141}
!141 = !DISubrange(count: 2)
!142 = !DIGlobalVariable(name: "LinearRepeatSampler", linkageName: "\01?LinearRepeatSampler@@3USamplerState@@A", scope: !0, file: !5, line: 90, type: !143, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?LinearRepeatSampler@@3USamplerState@@A")
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !143, file: !1, line: 90, baseType: !12, size: 32, align: 32, flags: DIFlagPrivate)
!146 = !DIGlobalVariable(name: "materialParameters", linkageName: "\01?materialParameters@@3V?$StructuredBuffer@UMaterialParameters@@@@A", scope: !0, file: !5, line: 92, type: !147, isLocal: false, isDefinition: true, variable: %"class.StructuredBuffer<MaterialParameters>"* @"\01?materialParameters@@3V?$StructuredBuffer@UMaterialParameters@@@@A")
!147 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<MaterialParameters>", file: !1, line: 92, size: 640, align: 32, elements: !148, templateParams: !159)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !147, file: !1, line: 92, baseType: !150, size: 640, align: 32)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "MaterialParameters", file: !5, line: 23, size: 640, align: 32, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157, !158}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "Emissive", scope: !150, file: !5, line: 24, baseType: !8, size: 128, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !150, file: !5, line: 26, baseType: !8, size: 128, align: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !150, file: !5, line: 28, baseType: !8, size: 128, align: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !150, file: !5, line: 30, baseType: !8, size: 128, align: 32, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "SpecularPower", scope: !150, file: !5, line: 32, baseType: !17, size: 32, align: 32, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "TextureIndex", scope: !150, file: !5, line: 33, baseType: !64, size: 32, align: 32, offset: 544)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Padding", scope: !150, file: !5, line: 34, baseType: !48, size: 64, align: 32, offset: 576)
!159 = !{!160}
!160 = !DITemplateTypeParameter(name: "element", type: !150)
!161 = !{i32 2, !"Dwarf Version", i32 4}
!162 = !{i32 2, !"Debug Info Version", i32 3}
!163 = !{!"dxc 1.2"}
